# regions.py

regions = {
    # استان تهران
    'تهران': ['تهران', 'کرج', 'ورامین', 'شمیرانات', 'پاکدشت', 'ری'],
    
    # استان اصفهان
    'اصفهان': ['اصفهان', 'کاشان', 'نطنز', 'نجف‌آباد', 'خمینی‌شهر', 'فریدن', 'سمیرم', 'شاهین‌شهر'],
    
    # استان خراسان رضوی
    'خراسان رضوی': ['مشهد', 'تربت حیدریه', 'سبزوار', 'گناباد', 'نیشابور', 'کاشمر'],
    
    # استان فارس
    'فارس': ['شیراز', 'مرودشت', 'فسا', 'لار', 'سروستان', 'جهرم', 'استهبان'],
    
    # استان آذربایجان شرقی
    'آذربایجان شرقی': ['تبریز', 'مراغه', 'اهر', 'آذرشهر', 'بستان‌آباد'],
    
    # استان زنجان
    'زنجان': ['زنجان', 'خرمدره'],
    
    # استان قم
    'قم': ['قم'],
    
    # استان کردستان
    'کردستان': ['سنندج', 'بانه', 'سقز'],
    
    # استان سیستان و بلوچستان
    'سیستان و بلوچستان': ['زاهدان', 'چابهار', 'ایرانشهر'],
    
    # استان گیلان
    'گیلان': ['رشت', 'آستارا', 'انزلی'],
    
    # استان مازندران
    'مازندران': ['ساری', 'بابل', 'آمل'],
    
    # استان البرز
    'البرز': ['کرج'],
    
    # استان هرمزگان
    'هرمزگان': ['بندرعباس', 'میناب'],
    
    # استان خراسان شمالی
    'خراسان شمالی': ['بجنورد'],
    
    # استان چهارمحال و بختیاری
    'چهارمحال و بختیاری': ['شهرکرد'],
    
    # استان لرستان
    'لرستان': ['خرم‌آباد', 'بروجرد'],
    
    # استان ایلام
    'ایلام': ['ایلام'],
    
    # استان کهگیلویه و بویراحمد
    'کهگیلویه و بویراحمد': ['یاسوج'],
    
    # استان سمنان
    'سمنان': ['سمنان', 'شاهرود'],
    
    # استان خوزستان
    'خوزستان': ['اهواز', 'خرمشهر', 'آبادان'],
    
    # استان قزوین
    'قزوین': ['قزوین'],
    
    # استان مرکزی
    'مرکزی': ['اراک', 'خنداب'],
    
    # استان یزد
    'یزد': ['یزد', 'میبد'],
    
    # استان گلستان
    'گلستان': ['گرگان', 'آزادشهر'],
    
    # استان خراسان جنوبی
    'خراسان جنوبی': ['بیرجند', 'قائن'],
}
